MomoRC-tech/Viessmann-Waermepumpe-in-ESPhome-with-Optolink-DIY/Vitocal_Optolink-esp32C3/HA_mqtt_addin.h
// home assistant integration ##########################################

#pragma once

#include <ArduinoHA.h>
#if defined(ESP8266)
    #include <ESP8266WiFi.h>
#elif defined(ESP32)
    #include <WiFi.h>
#endif
#include "Vitocal_datapoints.h"
#include "Vitocal_polling.h"
extern volatile uint32_t vitoErrorThreshold; // from main sketch

// prefix to have unique IDs
#define HA_PREFIX "wp_"   

// If set to 1 (via the main .ino before including this header), the device
// unique_id is derived from the MAC address in setupHomeAssistant().
#ifndef HA_DEVICE_UNIQUE_ID_FROM_MAC
    #define HA_DEVICE_UNIQUE_ID_FROM_MAC 0
#endif

//*** forward declararions ***************************************************
void onMQTTConnected(void);
void onMQTTMessage(const char* topic, const uint8_t* payload, uint16_t length);
void setRaumSoll (HANumeric number, HANumber* sender);
void setRaumSollRed (HANumeric number, HANumber* sender);
void setWWSoll (HANumeric number, HANumber* sender);
void setWWSoll2 (HANumeric number, HANumber* sender);
void setHystWWsoll (HANumeric number, HANumber* sender);

void setHKniveau (HANumeric number, HANumber* sender);
void setHKneigung (HANumeric number, HANumber* sender);

void onTargetTemperatureCommand(HANumeric temperature, HAHVAC* sender);
void onPowerCommand(bool state, HAHVAC* sender);
void onModeCommand(HAHVAC::Mode mode, HAHVAC* sender);
void onManualModeCommand(int8_t index, HASelect* sender);

//*** sensor definitions ***************************************************
HASensorNumber RelEHeizStufeSens    (HA_PREFIX "EHeizstufe",        HANumber::PrecisionP0);   //working
HASensorNumber AussenTempSens       (HA_PREFIX "Aussentemperatur",  HANumber::PrecisionP1);   //working
HASensorNumber WWtempObenSens       (HA_PREFIX "WarmwasserOben",    HANumber::PrecisionP1);   //working
HASensorNumber VorlaufTempSetSens   (HA_PREFIX "VorlaufSoll",       HANumber::PrecisionP0);   //working
HASensorNumber VorlaufTempSens      (HA_PREFIX "Vorlauf",           HANumber::PrecisionP0);   //working
HASensorNumber RuecklaufTempSens    (HA_PREFIX "Ruecklauf",         HANumber::PrecisionP0);   //working

HABinarySensor heizkreispumpeSens       (HA_PREFIX "Heizkreispumpe");
HABinarySensor WWzirkulationspumpeSens  (HA_PREFIX "WWZirkulation");
HASensor       ventilHeizenWWSens       (HA_PREFIX "VentilHeizenWW");
HABinarySensor RelVerdichterSens        (HA_PREFIX "Verdichter");
HABinarySensor RelPrimaerquelleSens      (HA_PREFIX "Grundwasserpumpe");
HABinarySensor RelSekundaerPumpeSens    (HA_PREFIX "Sekundaerpumpe");

HABinarySensor Stoerung         (HA_PREFIX "WPStoerung");

HAHVAC HVACwaermepumpe(
    HA_PREFIX "Waermepumpe",
  HAHVAC::TargetTemperatureFeature | HAHVAC::PowerFeature | HAHVAC::ModesFeature
);

//*** set values ***************************************************
HANumber  WWtempSollSens       (HA_PREFIX "WarmwasserSoll",     HANumber::PrecisionP0);
HANumber  WWtempSoll2Sens      (HA_PREFIX "WarmwasserSoll2",    HANumber::PrecisionP0);
HANumber  RaumSollTempSens     (HA_PREFIX "Raumtemperatur",     HANumber::PrecisionP1);
HANumber  HystWWsollSens       (HA_PREFIX "HystereseWWsoll",    HANumber::PrecisionP1);

HANumber  HKneigungSens       (HA_PREFIX "NeigungHeizkennlinie",    HANumber::PrecisionP1);
HANumber  HKniveauSens        (HA_PREFIX "NiveauHeizkennlinie",    HANumber::PrecisionP1);

HANumber  RaumSollRedSens      (HA_PREFIX "RaumtemperaturRed",  HANumber::PrecisionP1);
HASensor  operationmodeSens    (HA_PREFIX "Betriebsmodus"); 
HASensor  manualmodeSens       (HA_PREFIX "ManualMode");
HASelect  selectManualMode     (HA_PREFIX "setManualMode");

HANumber fastPollInterval(HA_PREFIX "fastPollInterval");
HANumber mediumPollInterval(HA_PREFIX "mediumPollInterval");
HANumber slowPollInterval(HA_PREFIX "slowPollInterval");

// Diagnostics: error counters and threshold
HASensorNumber vitoErrorCountSens(HA_PREFIX "vito_error_count", HANumber::PrecisionP0);
HASensorNumber vitoConsecErrorSens(HA_PREFIX "vito_consecutive_errors", HANumber::PrecisionP0);
HANumber errorThresholdNumber(HA_PREFIX "vito_error_threshold", HANumber::PrecisionP0);

//###########################################################################
// setup home assistant integration##########################################
void setupHomeAssistant() {   
    #if HA_DEVICE_UNIQUE_ID_FROM_MAC
        // IMPORTANT: Ensure a stable unique_id in Home Assistant.
        // If the device unique ID changes between firmware versions, HA will
        // discover a *second* set of entities and append "_2" to the entity_id.
        // Using the hardware MAC keeps it stable across re-flashes.
        static bool uniqueIdSet = false;
        if (!uniqueIdSet) {
            byte mac[6];
            WiFi.macAddress(mac);
            device.setUniqueId(mac, sizeof(mac));
            uniqueIdSet = true;
        }
    #endif

    //*** HA device ***************************************************
    device.setName(DEVICE_NAME);
    device.setSoftwareVersion(DEVICE_SWVERSION);
    device.setManufacturer(DEVICE_MANUFACTURER);
    device.setModel(DEVICE_MODEL); 
    device.enableSharedAvailability();
    device.enableLastWill();

    // Force stable entity_ids in Home Assistant.
    // HA generates entity_id primarily from MQTT discovery "object_id".
    // Without this, HA may generate entity_ids based on the device name
    // when entities are recreated.
    RelEHeizStufeSens.setObjectId(HA_PREFIX "EHeizstufe");
    AussenTempSens.setObjectId(HA_PREFIX "Aussentemperatur");
    WWtempObenSens.setObjectId(HA_PREFIX "Warmwasser_Oben");
    VorlaufTempSetSens.setObjectId(HA_PREFIX "Vorlauf_Soll");
    VorlaufTempSens.setObjectId(HA_PREFIX "Vorlauf");
    RuecklaufTempSens.setObjectId(HA_PREFIX "Ruecklauf");

    heizkreispumpeSens.setObjectId(HA_PREFIX "Heizkreispumpe");
    WWzirkulationspumpeSens.setObjectId(HA_PREFIX "WW_Zirkulation");
    ventilHeizenWWSens.setObjectId(HA_PREFIX "ventil_heizen_ww");
    RelVerdichterSens.setObjectId(HA_PREFIX "Verdichter");
    RelPrimaerquelleSens.setObjectId(HA_PREFIX "Grundwasserpumpe");
    RelSekundaerPumpeSens.setObjectId(HA_PREFIX "Sekundaerpumpe");
    Stoerung.setObjectId(HA_PREFIX "Stoerung");
    HVACwaermepumpe.setObjectId(HA_PREFIX "Waermepumpe");

