MomoRC-tech/Viessmann-Waermepumpe-in-ESPhome-with-Optolink-DIY/Vitocal_Optolink-esp32C3/HA_mqtt_addin.h
    // publish default polling intervals so HA sees initial state (seconds)
    fastPollInterval.setState((float)(vitoFastState.intervalMs / 1000UL));
    mediumPollInterval.setState((float)(vitoMediumState.intervalMs / 1000UL));
    slowPollInterval.setState((float)(vitoSlowState.intervalMs / 1000UL));
    

    // diagnostics setup
    vitoErrorCountSens.setIcon("mdi:counter");
    vitoErrorCountSens.setName("VitoWiFi Error Count");
    vitoConsecErrorSens.setIcon("mdi:counter");
    vitoConsecErrorSens.setName("VitoWiFi Consecutive Errors");

    errorThresholdNumber.setIcon("mdi:alert-decagram-outline");
    errorThresholdNumber.setName("VitoWiFi Error Threshold");
    errorThresholdNumber.setUnitOfMeasurement("");
    errorThresholdNumber.setMin(1);
    errorThresholdNumber.setMax(100);
    errorThresholdNumber.setStep(1);
    errorThresholdNumber.setMode(HANumber::ModeBox);  
    errorThresholdNumber.setRetain(true);
    errorThresholdNumber.onCommand([](HANumeric value, HANumber* sender) {
        if (!value.isSet() || sender == nullptr) {
            return;
        }
        int v = (int)value.toFloat();
        if (v < 1) v = 1;
        if (v > 100) v = 100;
        vitoErrorThreshold = (uint32_t)v;
        sender->setState((float)v);
    });
    errorThresholdNumber.setState((float)vitoErrorThreshold);
}


// VitoWiFi v3 instance and datapoints (defined elsewhere)
extern volatile bool vitoWritePending;  // Flag to pause read polling during writes
extern VitoWiFi::Datapoint setTempRaumSoll;
extern VitoWiFi::Datapoint setTempRaumSollRed;
extern VitoWiFi::Datapoint setTempHystWWsoll;
extern VitoWiFi::Datapoint setTempHKneigung;
extern VitoWiFi::Datapoint setTempHKniveau;
extern VitoWiFi::Datapoint setTempWWsoll;
extern VitoWiFi::Datapoint setTempWWsoll2;
extern VitoWiFi::Datapoint setManualMode;

void setRaumSoll (HANumeric number, HANumber* sender) {
    uint32_t callTimeMs = millis();
    CONSOLE_SERIAL.println("──────────────────────────────────────────────────────");
    CONSOLE_SERIAL.println("[MQTT] setRaumSoll command received from Home Assistant");
    if (number.isSet()) {
        float val = number.toFloat();
        CONSOLE_SERIAL.printf("[MQTT] Parsed value: %.1f°C\n", val);
        CONSOLE_SERIAL.println("[MQTT] Validation: value in range [10.0...30.0]");
        CONSOLE_SERIAL.printf("[MQTT] Calling vitoWIFI.write(setTempRaumSoll, %.1f) at T=%lu ms\n", val, callTimeMs);
        if (vitoWIFI.write(setTempRaumSoll, val)) {
            vitoWritePending = true;  // Pause read polling
            uint32_t queueTimeMs = millis();
            CONSOLE_SERIAL.printf("[VITO] Write QUEUED: RaumSoll=%.1f°C at T=%lu ms\n", val, queueTimeMs);
            CONSOLE_SERIAL.printf("[VITO] Round-trip latency: %lu ms (init → queue)\n", queueTimeMs - callTimeMs);
            CONSOLE_SERIAL.println("[VITO] Status: vitoWritePending=true, read polling PAUSED");
            CONSOLE_SERIAL.println("[VITO] Waiting for onVitoResponse() or onVitoError()...");
        } else {
            CONSOLE_SERIAL.println("[VITO] Write FAILED: RaumSoll (VitoWiFi library busy, previous request in-flight)");
            CONSOLE_SERIAL.printf("[VITO] Failed at T=%lu ms\n", millis());
        }
    } else {
        CONSOLE_SERIAL.println("[MQTT] ERROR: command value not set");
    }
    sender->setState(number); // report the selected option back to the HA panel
    CONSOLE_SERIAL.println("[MQTT] State reported back to Home Assistant");
    CONSOLE_SERIAL.println("──────────────────────────────────────────────────────");
}

void setRaumSollRed (HANumeric number, HANumber* sender) {
    if (number.isSet()) {
        float val = number.toFloat();
        if (vitoWIFI.write(setTempRaumSollRed, val)) {
            vitoWritePending = true;  // Pause read polling
            CONSOLE_SERIAL.printf("Write queued: RaumSollRed=%.1f°C\n", val);
        } else {
            CONSOLE_SERIAL.println("Write failed: RaumSollRed (library busy)");
        }
    }
    sender->setState(number); // report the selected option back to the HA panel
}

void setHystWWsoll (HANumeric number, HANumber* sender) {
    if (number.isSet()) {
        float val = number.toFloat();
        if (vitoWIFI.write(setTempHystWWsoll, val)) {
            vitoWritePending = true;  // Pause read polling
            CONSOLE_SERIAL.printf("Write queued: HystWWsoll=%.1f°C\n", val);
        } else {
            CONSOLE_SERIAL.println("Write failed: HystWWsoll (library busy)");
        }
    }
    sender->setState(number); // report the selected option back to the HA panel
}

void setHKneigung (HANumeric number, HANumber* sender) {
    if (number.isSet()) {
        float val = number.toFloat();
        if (vitoWIFI.write(setTempHKneigung, val)) {
            vitoWritePending = true;  // Pause read polling
            CONSOLE_SERIAL.printf("Write queued: HKneigung=%.1f\n", val);
        } else {
            CONSOLE_SERIAL.println("Write failed: HKneigung (library busy)");
        }
    }
    sender->setState(number); // report the selected option back to the HA panel
}

void setHKniveau (HANumeric number, HANumber* sender) {
    if (number.isSet()) {
        float val = number.toFloat();
        if (vitoWIFI.write(setTempHKniveau, val)) {
            vitoWritePending = true;  // Pause read polling
            CONSOLE_SERIAL.printf("Write queued: HKniveau=%.1f K\n", val);
        } else {
            CONSOLE_SERIAL.println("Write failed: HKniveau (library busy)");
        }
    }
    sender->setState(number); // report the selected option back to the HA panel
}

void setWWSoll (HANumeric number, HANumber* sender) {
    if (number.isSet()) {
        float val = number.toFloat();
        if (vitoWIFI.write(setTempWWsoll, val)) {
            vitoWritePending = true;  // Pause read polling
            CONSOLE_SERIAL.printf("Write queued: WWSoll=%.1f°C\n", val);
        } else {
            CONSOLE_SERIAL.println("Write failed: WWSoll (library busy)");
        }
    }
    sender->setState(number); // report the selected option back to the HA panel
}

void setWWSoll2 (HANumeric number, HANumber* sender) {
    if (number.isSet()) {
        float val = number.toFloat();
        if (vitoWIFI.write(setTempWWsoll2, val)) {
            vitoWritePending = true;  // Pause read polling
            CONSOLE_SERIAL.printf("Write queued: WWSoll2=%.1f°C\n", val);
        } else {
            CONSOLE_SERIAL.println("Write failed: WWSoll2 (library busy)");
        }
    }
    sender->setState(number); // report the selected option back to the HA panel
}

void onTargetTemperatureCommand(HANumeric temperature, HAHVAC* sender) {
    float val = temperature.toFloat();
    if (vitoWIFI.write(setTempRaumSoll, val)) {
        vitoWritePending = true;  // Pause read polling
        CONSOLE_SERIAL.printf("Write queued: RaumSoll (HVAC)=%.1f°C\n", val);
    } else {
        CONSOLE_SERIAL.println("Write failed: RaumSoll (HVAC, library busy)");
    }

    sender->setTargetTemperature(temperature); // report target temperature back to the HA panel
}

void onPowerCommand(bool state, HAHVAC* sender) {
  if (state) {
    Serial.println("Power on");
  } else {
    Serial.println("Power off");
  }
}

void onModeCommand(HAHVAC::Mode mode, HAHVAC* sender) {
    if (mode == HAHVAC::OffMode) {
        Serial.println("off");
    } else if (mode == HAHVAC::AutoMode) {
        Serial.println("auto");
    } else if (mode == HAHVAC::CoolMode) {
        Serial.println("cool");
    } else if (mode == HAHVAC::HeatMode) {
        Serial.println("heat");
    } else if (mode == HAHVAC::DryMode) {
        Serial.println("dry");
    } else if (mode == HAHVAC::FanOnlyMode) {
        Serial.println("fan only");
    }

    sender->setMode(mode); // report mode back to the HA panel
}

void onManualModeCommand(int8_t index, HASelect* sender)
{
    const char* modeLabel = "unknown";
    switch (index) {
    case 0:
        // Option "Normal" was selected
        modeLabel = "Normal";
        if (vitoWIFI.write(setManualMode, static_cast<uint8_t>(index))) {
            vitoWritePending = true;  // Pause read polling
            CONSOLE_SERIAL.println("Write queued: ManualMode=Normal");
        } else {
            CONSOLE_SERIAL.println("Write failed: ManualMode (library busy)");
        }
        break;

    case 1:
        // Option "Manueller Heizbetrieb" was selected
        modeLabel = "Manuel";
        if (vitoWIFI.write(setManualMode, static_cast<uint8_t>(index))) {
            vitoWritePending = true;  // Pause read polling
            CONSOLE_SERIAL.println("Write queued: ManualMode=Manuel");
        } else {
            CONSOLE_SERIAL.println("Write failed: ManualMode (library busy)");
        }
        break;

    case 2:
        // Option "1x WW auf Temp2" was selected
        modeLabel = "WW auf Temp2";
        if (vitoWIFI.write(setManualMode, static_cast<uint8_t>(index))) {
            vitoWritePending = true;  // Pause read polling
            CONSOLE_SERIAL.println("Write queued: ManualMode=WW auf Temp2");
        } else {
            CONSOLE_SERIAL.println("Write failed: ManualMode (library busy)");
        }
        break;

    default:
        // unknown option
        return;
    }

    sender->setState(index); // report the selected option back to the HA panel
}

void onMQTTMessage(const char* topic, const uint8_t* payload, uint16_t length) {
    // this method will be called each time the device receives an MQTT message
}

void onMQTTConnected() {
    // this method will be called when connection to MQTT broker is established
    device.publishAvailability();

    // Publish initial states for HA "Number" entities.
    // If setState() runs before MQTT is connected, ArduinoHA may not publish it later,
    // which makes the value appear empty/unknown in Home Assistant.
    fastPollInterval.setState((float)(vitoFastState.intervalMs / 1000UL));
    mediumPollInterval.setState((float)(vitoMediumState.intervalMs / 1000UL));
    slowPollInterval.setState((float)(vitoSlowState.intervalMs / 1000UL));
    errorThresholdNumber.setState((float)vitoErrorThreshold);
}
